Catalogs/упПравилаРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упПравилаРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БезопасныйРежимВнешнейОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяОбработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПроизвольногоРасчета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТарифнойСеткиПоСтолбцам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательТарифнойСеткиПоСтрокам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПроводитсяПоКаждойСтроке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкомпилированнаяФормула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упТипРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Переменные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТарифныеСетки</v8:Type>
								<v8:Type>cfg:CatalogRef.упОценочнаяШкала</v8:Type>
								<v8:Type>cfg:CatalogRef.упПоказателиРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИдентификаторыСсылок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>32</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/упТипыПоказателейРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упТипыПоказателейРасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расчетный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фиксированный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Comment>Организации</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительПредприятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упБанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упПравилаРасчета/Forms/ФормаПроверки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Формула 				 = Параметры.Формула;
	СкомпилированнаяФормула  = Параметры.СкомпилированнаяФормула;
	
	Данные		  			 = Новый Структура; // Данные(не показатели) используемые в алгоритмах расчета: 				 [Ключ - имя переменной в формуле], [Значение - значение переменной].
	Показатели	  			 = Новый Структура; // Показатели используемые в формуле: 										 [Ключ - код(идентификатор) показателя], [Значение - ссылка на показатель].
	ИдентификаторыРеквизитов = Новый Структура;	// Cоответствия между реквизитом формы и идентификатором переменной формулы: [Ключ - имя реквизита], [Значение - идентификатор переменной].
	
	мсвСтруктураЭлементов	 = Новый Массив; 	// Содержит структуру элементов, имеет вид (Переменная, Параметры, Значения).
		
	дрвПеременные 			= упТарификацияВызовСервера.ПолучитьПеременные(Параметры.Переменные); // Переменные - ссылки на используемые шкалы и показатели расчета.
																							  // Корень дерева - для определения есть ли фиксированные показатели.
	// Если в формуле задействованы переменные.
	Если НЕ дрвПеременные = Неопределено Тогда
		
		мсвДобавляемыеРеквизиты	= Новый Массив; // Реквизиты добавляемые на форму.
		
		НомерСтроки = 0;
		
		Для каждого текСписокПеременных Из дрвПеременные.Строки Цикл
								
			// Если в списке попался фиксированный показатель, то необходимо добавить параметр "Организация".
			Если текСписокПеременных.ФиксированныйПоказатель > 0 Тогда
				ДобавитьПеременнуюОрганизация(мсвДобавляемыеРеквизиты,мсвСтруктураЭлементов, НомерСтроки); 	
				НомерСтроки = НомерСтроки + 1;
			КонецЕсли;
			
			// Для каждой переменной создается реквизит и элемент управления.
			Для каждого текСтрока Из  текСписокПеременных.Строки Цикл
						
				текИдентификатор = Сокрлп(текСтрока.Идентификатор);
				текЗначение 	 = текСтрока.Значение;
								
				// Если добавляется оценочная шкала.
				Если ТипЗнч(текЗначение) = Тип("СправочникСсылка.упОценочнаяШкала") Тогда
					ДобавитьПеременнуюОценочнаяШкала(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, НомерСтроки);					
					
				// Если добавляется тарифная сетка.
				ИначеЕсли ТипЗнч(текЗначение) = Тип("СправочникСсылка.упТарифныеСетки") Тогда
					ДобавитьПеременнуюТарифнаяСетка(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, НомерСтроки);						
					
				// Если добавляется показатель расчета.
				ИначеЕсли ТипЗнч(текЗначение) = Тип("СправочникСсылка.упПоказателиРасчета") Тогда
										
					Если текЗначение.ТипПоказателя = ПредопределенноеЗначение("Перечисление.упТипыПоказателейРасчета.Фиксированный") Тогда
						ДобавитьПеременнуюФиксированныйПоказатель(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, НомерСтроки);
					Иначе
						
						текЭтоСсылочныйПараметр = упТарификацияКлиентСервер.ЭтоСсылочныйПараметр(текЗначение.ПараметрРасчета);
						
						Если текЭтоСсылочныйПараметр Тогда
							ЗначениеПараметраЕстьСамПараметр	=  упТарификацияКлиентСервер.ЗначениемПараметраЕстьСамПараметр(текЗначение.ПараметрРасчета);
							ДобавитьПеременнуюСсылочныйПоказатель(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, ЗначениеПараметраЕстьСамПараметр, НомерСтроки);
						Иначе
																	
							Если упТарификацияКлиентСервер.ЭтоВременнойПараметр(текЗначение.ПараметрРасчета) Тогда
								ДобавитьПеременнуюВременнойПоказатель(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, НомерСтроки);
							ИначеЕсли упТарификацияКлиентСервер.ЭтоБулевыйПараметр(текЗначение.ПараметрРасчета) Тогда 	
								ДобавитьПеременнуюБулевыйПоказатель(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, НомерСтроки);	
							Иначе
								ДобавитьПеременнуюПоказатель(мсвДобавляемыеРеквизиты, текИдентификатор, текЗначение, мсвСтруктураЭлементов, НомерСтроки);
							КонецЕсли;
								
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли;
				НомерСтроки = НомерСтроки + 1;
			КонецЦикла;
									
			ИзменитьРеквизиты(мсвДобавляемыеРеквизиты);
			
			Для каждого текЭлемент Из мсвСтруктураЭлементов Цикл
				текОтказ = Ложь;
				ДобавитьЭлементФормы(текЭлемент, текОтказ);
			КонецЦикла;
		
			РассчитатьПоказателиНаСервере();
									
		КонецЦикла;
				
	КонецЕсли;
	
	РассчитатьФормулуНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеВводаПриИзмененииЗначения(Элемент)
	// Устанавливается значение показателя .
	текИдентификаторРеквизита = "";
	Если НЕ ИдентификаторыРеквизитов.Свойство(Элемент.Имя, текИдентификаторРеквизита) = Неопределено Тогда
		ЗначенияПоказателей.Вставить(текИдентификаторРеквизита, ЭтаФорма[Элемент.Имя]);	
		РассчитатьФормулуНаСервере();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаСсылочныйПараметрПриИзмененииЗначения(Элемент)
	ПересчитатьЗначениеСсылочногоПоказателяНаСервере(Элемент.Имя);		
КонецПроцедуры

&НаКлиенте
Процедура ПолеВводаОрганизацияПриИзмененииЗначения(Элемент)
	ПересчитатьФиксированныеПоказателиНаСервере();		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

#Область ДобавлениеЭлементовУправления

&НаСервере
// Процедура - Формирует массив реквизитов.
//
// Параметры:
//  мсвДобавляемыеРеквизиты	 - Массив 	- массив в который добавляется реквизит.
//  ТипРеквизита			 - Тип 		- тип реквизита.
//  Имя						 - Строка	- имя реквизита.
//
Процедура ДобавитьРеквизит(мсвДобавляемыеРеквизиты, ТипРеквизита, Имя)
	Если ТипЗнч(ТипРеквизита) = Тип("Массив") Тогда
		мсвТипов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ТипРеквизита);
	Иначе	
		мсвТипов = Новый Массив;	
		мсвТипов.Добавить(ТипРеквизита);
	КонецЕсли;
	
	текТип 		= Новый ОписаниеТипов(мсвТипов, ,,Новый КвалификаторыЧисла(10,3));
	текРеквизит = Новый РеквизитФормы(Имя, текТип);
	мсвДобавляемыеРеквизиты.Добавить(текРеквизит);
КонецПроцедуры

&НаСервере
// Процедура - Определяет тип элемента и добавляет его на форму.
//
// Параметры:
//  Элемент	 - Структура - описание элемента формы.
//  Отказ	 - Булево	 - Истина, если добавить не удалось.
//
Процедура ДобавитьЭлементФормы(Элемент, Отказ)
	
	ТипЭлемента = Неопределено;
	ИмяЭлемента	= Неопределено;
	
	Если Элемент.Свойство("Имя", ИмяЭлемента) = Неопределено Тогда
		ТекстСообщения = Нстр("ru = 'Не задано имя элемента'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
		Возврат;
	КонецЕсли;
	
	Если НЕ Элемент.Свойство("Тип", ТипЭлемента) = Неопределено Тогда
		Если ТипЭлемента = Тип("ПолеФормы") Тогда
			ДобавитьЭлементПолеФормы(Элемент, Отказ);
		ИначеЕсли ТипЭлемента = Тип("ГруппаФормы") Тогда
			ДобавитьЭлементГруппаФормы(Элемент, Отказ);
		ИначеЕсли ТипЭлемента = Тип("ДекорацияФормы") Тогда 
			ДобавитьЭлементДекарацияФормы(Элемент, Отказ);	
		Иначе	
			ТекстСообщения = Нстр("ru = 'Добавление элемента ""%1"" с типом ""%2"" не предусмотрено'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ИмяЭлемента, ТипЭлемента);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
		КонецЕсли;
	Иначе	
		ТекстСообщения = Нстр("ru = 'Не задан тип элемента ""%1""'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ИмяЭлемента);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);	
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Добавляет на форму элемент типа "ПолеФормы".
//
// Параметры:
//  Элемент	 - Структура - Описание элемента формы.
//  Отказ	 - Булево	 - Истина, в случае ошибки при добавлении.
//
Процедура ДобавитьЭлементПолеФормы(Элемент, Отказ)
	
	ЭлементФормы	= Элементы.Добавить(Элемент.Имя, Тип("ПолеФормы"), Элементы[Элемент.ГруппаФормы]);
	
	ЭлементФормы.РастягиватьПоГоризонтали	= Истина;

	текВид = Неопределено;
	Если НЕ Элемент.Свойство("Вид", текВид) Тогда
		текВид = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	ЭлементФормы.Вид = текВид;
	
	текЗаголовок	= Неопределено;
	Если Элемент.Свойство("Заголовок", текЗаголовок) Тогда
		ЭлементФормы.Заголовок = текЗаголовок;			
	Иначе
		ЭлементФормы.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	КонецЕсли;

	текТолькоПросмотр =  Неопределено;
	Если Элемент.Свойство("ТолькоПросмотр", текТолькоПросмотр) Тогда
		ЭлементФормы.ТолькоПросмотр = текТолькоПросмотр;			
	КонецЕсли;

	ЭлементФормы.ПутьКДанным 		= Элемент.Имя;
	
	текПодсказка = Неопределено;
	Если Элемент.Свойство("Подсказка", текПодсказка) Тогда
		ЭлементФормы.Подсказка				= текПодсказка;
		ЭлементФормы.ОтображениеПодсказки	= ОтображениеПодсказки.Кнопка;	
	КонецЕсли;
	
	текДействиеПриИзменении = Неопределено;
	Если Элемент.Свойство("ДействиеПриИзменении", текДействиеПриИзменении) Тогда
		ЭлементФормы.УстановитьДействие("ПриИзменении", текДействиеПриИзменении);		
	КонецЕсли;
	
	текЭтоГиперссылка = Неопределено;
	Если Элемент.Свойство("Гиперссылка", текЭтоГиперссылка) Тогда
		ЭлементФормы.Гиперссылка = текЭтоГиперссылка;			
	КонецЕсли;


	Если текВид = ВидПоляФормы.ПолеКартинки Тогда
		ЭлементФормы.РастягиватьПоГоризонтали = Ложь;
		ЭлементФормы.РастягиватьПоВертикали = Ложь;
		ЭлементФормы.Ширина = 2;
		ЭлементФормы.Высота = 1;
		ЭлементФормы.КартинкаЗначений = БиблиотекаКартинок.упТипыПоказателей;
		ЭлементФормы.Рамка	= Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	КонецЕсли;
	
	текЗначение = Неопределено;
	Если Элемент.Свойство("Значение", текЗначение) Тогда
		ЭтаФорма[Элемент.Имя] = текЗначение;
	КонецЕсли;
	
	РастягиватьПоГоризонтали = Истина;
	//Если Элемент.Свойство("РастягиватьПоГоризонтали", РастягиватьПоГоризонтали) Тогда
		ЭлементФормы.РастягиватьПоГоризонтали = РастягиватьПоГоризонтали;			
	//КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
// Процедура - Добавляет на форму элемент типа "ДекорацияФормы".
//
// Параметры:
//  Элемент	 - Структура - Описание элемента формы.
//  Отказ	 - Булево	 - Истина, в случае ошибки при добавлении.
//
Процедура ДобавитьЭлементДекарацияФормы(Элемент, Отказ)
	
	ЭлементФормы 	 = Элементы.Добавить(Элемент.Имя, Тип("ДекорацияФормы"), Элементы[Элемент.ГруппаФормы]);
	ЭлементФормы.Вид = Элемент.Вид;
	
	текЗаголовок = Неопределено;
	Если Элемент.Свойство("Заголовок", текЗаголовок) Тогда
		ЭлементФормы.Заголовок = текЗаголовок;			
	КонецЕсли;
	
	РастягиватьПоГоризонтали = Истина;
	//Если Элемент.Свойство("РастягиватьПоГоризонтали", РастягиватьПоГоризонтали) Тогда
		ЭлементФормы.РастягиватьПоГоризонтали = РастягиватьПоГоризонтали;			
	//КонецЕсли;

	
КонецПроцедуры

&НаСервере
// Процедура - Добавляет на форму элемент типа "ГруппаФормы".
//
// Параметры:
//  Элемент	 - Структура - Описание элемента формы.
//  Отказ	 - Булево	 - Истина, в случае ошибки при добавлении.
//
Процедура ДобавитьЭлементГруппаФормы(Элемент, Отказ)
	
	ЭлементФормы 	 = Элементы.Добавить(Элемент.Имя, Тип("ГруппаФормы"), Элементы[Элемент.ГруппаФормы]);
	ЭлементФормы.Вид 		= ВидГруппыФормы.ОбычнаяГруппа;
	ЭлементФормы.ОтображатьЗаголовок = Ложь;
	ЭлементФормы.Отображение = ОтображениеОбычнойГруппы.Нет;
	ЭлементФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	ЭлементФормы.Высота		 = 3;
	ЦветФона = Неопределено;
	Если Элемент.Свойство("ЦветФона", ЦветФона)  Тогда
		ЭлементФормы.ЦветФона = ЦветФона;	
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти 


#Область ДобавлениеПеременных

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы относящееся к,
//					переменной "Организация", которая необходима для расчета,
//					фиксированного показателя.
//					
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюОрганизация(мсвРеквизитов, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= "Организация";
	текИмяРеквизита				= "Параметр"+текИдентификаторПеременной;
	текЗначение					= Справочники.Организации.ОрганизацияПоУмолчанию();
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
		
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.Организации"), текИмяРеквизита);
	
	Данные.Вставить("Организация", текЗначение);
	ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПоказателиСсылки",
												ЦветГруппы));

	
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы, Заголовок, РастягиватьПоГоризонтали", 
												Тип("ДекорацияФормы"), 
												"ПеременнаяОрганизация", 
												ВидДекорацииФормы.Надпись, 
												текИмяГруппы, 
												Нстр("ru = 'Организация'"),
												Истина));
												
	текИмяГруппы 				= "ГруппаПараметр"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));

	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ПутьКДанным",
	                                            Тип("ПолеФормы"),
												текИмяРеквизита, 
												текИмяГруппы,
												текЗначение, 
												Ложь, 
												Нстр("ru = 'Используется для расчета фиксированных показателей'"),
												"ПолеВводаОрганизацияПриИзмененииЗначения",
												текИмяРеквизита));
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));

											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы, РастягиватьПоГоризонтали", 
												Тип("ДекорацияФормы"), 
												"ЗначениеОрганизация", 
												ВидДекорацииФормы.Надпись, 
												текИмяГруппы,
												Истина));
КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					фиксированному показателю расчета.
//					
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усПоказательРасчетаТарифов	 - показатель расчета.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюФиксированныйПоказатель(мсвРеквизитов, Идентификатор, Переменная, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текЗначение					= Переменная;
	Показатели.Вставить(текИдентификаторПеременной, текЗначение);
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));


	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											1, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упПоказателиРасчета"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));
	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));

										
											
	// Добавляется реквизит для отображения параметра показателя.			
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
												Тип("ДекорацияФормы"), 
												текИмяРеквизита, 
												ВидДекорацииФормы.Надпись, 
												текИмяГруппы));
										
											
	// Добавляется реквизит для отображения значения показателя.
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;
	
	
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));


	
	текТипПараметра 			= упТарификацияКлиентСервер.ПолучитьТипПараметра(текЗначение.ПараметрРасчета); 
	мсвТипРеквизита	= Новый Массив;
	мсвТипРеквизита.Добавить(Тип("Число"));
	мсвТипРеквизита.Добавить(Тип("СправочникСсылка.упГеографическиеЗоны"));
	ДобавитьРеквизит(мсвРеквизитов, мсвТипРеквизита, текИмяРеквизита);
	ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											Истина, 
											Нстр("ru = 'Не редактируется. Устанавливается документом ""Установка значений показателей расчета"" для организации'"),
											"ПолеВводаПриИзмененииЗначения",
											текИмяГруппы));
КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					показателю расчета, значение которого определяется через параметр.
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усПоказательРасчетаТарифов	 - показатель расчета.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюСсылочныйПоказатель(мсвРеквизитов,  Идентификатор, Переменная, мсвЭлементы, БезЗначения = Ложь, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текЗначение					= Переменная;
	Показатели.Вставить(текИдентификаторПеременной, текЗначение);
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));


	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											Перечисления.упПараметрыРасчета.Индекс(текЗначение.ПараметрРасчета) + 2, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упПоказателиРасчета"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));

											
	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));

										
											
    // Добавляется реквизит для отображения параметра показателя.
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;
	текТипПараметра 			= упТарификацияКлиентСервер.ПолучитьТипПараметра(текЗначение.ПараметрРасчета); 
	ДобавитьРеквизит(мсвРеквизитов, текТипПараметра, текИмяРеквизита);
	ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ТолькоПросмотр, Подсказка, ДействиеПриИзменении", 
											Тип("ПолеФормы"),
											текИмяРеквизита, 
											текИмяГруппы,
											Ложь, 
											"",
											"ПолеВводаСсылочныйПараметрПриИзмененииЗначения"));
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));

		
														
	// Добавляется реквизит для отображения значения показателя.
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;
	
	Если БезЗначения Тогда
		ДобавитьРеквизит(мсвРеквизитов, Тип("Число"), текИмяРеквизита);
		ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
		мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
												Тип("ДекорацияФормы"), 
												текИмяРеквизита, 
												ВидДекорацииФормы.Надпись, 
												текИмяГруппы));

	ИначеЕсли упТарификацияВызовСервера.НеЗаменятьНаРазмер(Переменная) Тогда
		мсвТипРеквизита	= Новый Массив;
		мсвТипРеквизита.Добавить(ТипЗнч(упТарификацияКлиентСервер.ПолучитьПустоеЗначение(текЗначение.ПараметрРасчета)));
		ДобавитьРеквизит(мсвРеквизитов, мсвТипРеквизита, текИмяРеквизита);
		ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
		мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											, 
											Истина, 
											Нстр("ru = 'Не редактируется. Так как в табличной части показателя нет строк, то значение совпадает со значением параметра.'"),
											"ПолеВводаПриИзмененииЗначения",
											текИмяГруппы));
											
	Иначе	
		ДобавитьРеквизит(мсвРеквизитов, Тип("Число"), текИмяРеквизита);
		ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);										
		мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											Ложь, 
											Нстр("ru = 'Рассчитывается по заданному алгоритму или заполняется вручную. Зависит от выбранного значения параметра.'"),
											"ПолеВводаПриИзмененииЗначения",
											текИмяГруппы));
	
	КонецЕсли;
КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					показателю расчета с типом значения дата.
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усПоказательРасчетаТарифов	 - показатель расчета.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюВременнойпоказатель(мсвРеквизитов,  Идентификатор, Переменная, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текЗначение					= Переменная;
	Показатели.Вставить(текИдентификаторПеременной, текЗначение);
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));


	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											Перечисления.упПараметрыРасчета.Индекс(текЗначение.ПараметрРасчета) + 2, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упПоказателиРасчета"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));
	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));


											
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы));
										
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));

										
    										
	// Добавляется реквизит для отображения значения показателя.
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов, Тип("Дата"), текИмяРеквизита);
	ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											Ложь, 
											Нстр("ru = 'Рассчитывается по заданному алгоритму или заполняется вручную'"),
											"ПолеВводаПриИзмененииЗначения",
											текИмяГруппы));
	
КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					показателю расчета с числовым типом значения.
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усПоказательРасчетаТарифов	 - показатель расчета.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюПоказатель(мсвРеквизитов,  Идентификатор, Переменная, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текЗначение					= Переменная;
	Показатели.Вставить(текИдентификаторПеременной, текЗначение);
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));

	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											Перечисления.упПараметрыРасчета.Индекс(текЗначение.ПараметрРасчета) + 2, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упПоказателиРасчета"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));

	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));
									
											
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы, РастягиватьПоГоризонтали", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы,
											Истина));
											
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));
										
    										
	// Добавляется реквизит для отображения значения показателя.
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов, Тип("Число"), текИмяРеквизита);
	ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ГруппаФормы", 
	                                        Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											Ложь, 
											Нстр("ru = 'Рассчитывается по заданному алгоритму или заполняется вручную'"),
											"ПолеВводаПриИзмененииЗначения",
											текИмяГруппы));
	
	
КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					показателю расчета с числовым типом значения.
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усПоказательРасчетаТарифов	 - показатель расчета.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюБулевыйПоказатель(мсвРеквизитов,  Идентификатор, Переменная, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текЗначение					= Переменная;
	Показатели.Вставить(текИдентификаторПеременной, текЗначение);
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));


	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											Перечисления.упПараметрыРасчета.Индекс(текЗначение.ПараметрРасчета) + 2, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упПоказателиРасчета"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));

	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));

										
											
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы));
											
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));

										
    										
	// Добавляется реквизит для отображения значения показателя.
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов, Тип("Булево"), текИмяРеквизита);
	ИдентификаторыРеквизитов.Вставить(текИмяРеквизита, текИдентификаторПеременной);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, ТолькоПросмотр, Подсказка, ДействиеПриИзменении, ГруппаФормы", 
	                                        Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											Ложь, 
											Нстр("ru = 'Рассчитывается по заданному алгоритму или заполняется вручную'"),
											"ПолеВводаПриИзмененииЗначения",
											текИмяГруппы));
	
КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					оценочной шкале.
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усОценочнаяШкала	 - шкала.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюОценочнаяШкала(мсвРеквизитов,  Идентификатор, Переменная, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текИмяРеквизита				= "Параметр"+текИдентификаторПеременной;
	текЗначение					= Переменная;
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	
	Данные.Вставить(текИдентификаторПеременной, текЗначение);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));


	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упОценочнаяШкала"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));
	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));

											
											
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы));
											
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));
							
											
											
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы));
											
										
							

КонецПроцедуры

&НаСервере
// Процедура - Добавляет реквизит и описание элемента формы соответствующего,
//					оценочной шкале.
//
// Параметры:
//  мсвРеквизитов	 - Массив	 - реквизиты формы.
//  Идентификатор	 - Строка	 - идентификатор показателя.
//  Переменная		 - СправочникСсылка.усОценочнаяШкала	 - шкала.
//  мсвЭлементы		 - Массив	 - массив описаний элементов формы.
//
Процедура ДобавитьПеременнуюТарифнаяСетка(мсвРеквизитов,  Идентификатор, Переменная, мсвЭлементы, НомерСтроки)
	
	текИдентификаторПеременной 	= Идентификатор;
	текИмяРеквизита				= "Параметр"+текИдентификаторПеременной;
	текЗначение					= Переменная;
	ЦветГруппы					= ОпределитьЦветГруппы(НомерСтроки);
	
	
	Данные.Вставить(текИдентификаторПеременной, текЗначение);
	
	текИмяГруппы 				= "ГруппаПоказатель"+текИдентификаторПеременной;
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
											Тип("ГруппаФормы"), 
											текИмяГруппы, 
											"ГруппаПоказателиСсылки",
											ЦветГруппы));


	
	
	//  Добавляется реквизит для отображения картинки показателя расчета.
	текИмяРеквизита				= "Картинка" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("Число"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											0, 
											ВидПоляФормы.ПолеКартинки,
											текИмяГруппы));
	
	// Добавляется реквизит для отображения ссылки на показатель расчета.
	текИмяРеквизита				= "Показатель" + текИдентификаторПеременной;
	ДобавитьРеквизит(мсвРеквизитов,	Тип("СправочникСсылка.упТарифныеСетки"), текИмяРеквизита);
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Значение, Вид, ГруппаФормы, Гиперссылка", 
											Тип("ПолеФормы"), 
											текИмяРеквизита, 
											текЗначение, 
											ВидПоляФормы.ПолеНадписи, 
											текИмяГруппы,
											Истина));
	текИмяГруппы 				= "ГруппаПараметры"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаПараметры",
												ЦветГруппы));

											
											
	текИмяРеквизита				= "Параметр" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы));
											
	текИмяГруппы 				= "ГруппаЗначения"+текИдентификаторПеременной;											
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, ГруппаФормы, ЦветФона", 
												Тип("ГруппаФормы"), 
												текИмяГруппы, 
												"ГруппаЗначения",
												ЦветГруппы));
							
											
											
	текИмяРеквизита				= "Значение" + текИдентификаторПеременной;										
	мсвЭлементы.Добавить(Новый Структура("Тип, Имя, Вид, ГруппаФормы", 
											Тип("ДекорацияФормы"), 
											текИмяРеквизита, 
											ВидДекорацииФормы.Надпись, 
											текИмяГруппы));
											
										
							

КонецПроцедуры



&НаСервере
Функция ОпределитьЦветГруппы(НомерСтроки)
	
	текРезультат = Новый Цвет(); 
	
	Если НомерСтроки % 2 = 0 Тогда
		текРезультат = ЦветаСтиля.упЦветФонаНевыбранногоКонтейнера;
	Иначе
		текРезультат = ЦветаСтиля.ЦветФонаФормы;	
	КонецЕсли;
	
	Возврат текРезультат;
	
КонецФункции

#КонецОбласти


#Область РасчетПоказателейИФормулы

&НаСервере
// Процедура - Рассчитывает значения показателей расчета.
//
Процедура РассчитатьПоказателиНаСервере()
	
	текОтказ = Ложь;
	
	ЗначенияПоказателей = упТарификацияВызовСервера.РассчитатьПоказатели(Показатели, Данные, текОтказ);
	
	Для каждого текЗначение Из ЗначенияПоказателей Цикл
		ЭтаФорма["Значение"+текЗначение.Ключ] = текЗначение.Значение;
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Функция - Рассчитывает формулу.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Строка - расчет формулы, с подстановкой значений показателей.
//
Функция РассчитатьФормулуНаСервере()
		
	сткЗначенияПеременных =Новый Структура();
	
	текФорматЧисла = "ЧРД=.; ЧН=; ЧГ=; ДП='01.01.0001 0:00:00'";
	
	Для каждого текСтрока Из Данные Цикл
		сткЗначенияПеременных.Вставить(текСтрока.Ключ, текСтрока.Значение);	
	КонецЦикла;
	
	Результат = СкомпилированнаяФормула;

	Если НЕ ЗначенияПоказателей = Неопределено Тогда
		Для каждого текСтрока Из ЗначенияПоказателей Цикл
			сткЗначенияПеременных.Вставить(текСтрока.Ключ, текСтрока.Значение);	
			
			текПодстрока = "сткПеременные."+ВРЕГ(текСтрока.Ключ);
			
			текЗначениеЗамены =Формат(текСтрока.Значение, текФорматЧисла);
						
			Результат =СтрЗаменить(Результат, текПодстрока + ",", текЗначениеЗамены + ",");
			Результат =СтрЗаменить(Результат, текПодстрока + ")", текЗначениеЗамены + ")");
		КонецЦикла;
	КонецЕсли;
		
	Отказ = Ложь;
	ИнформацияОбОшибке = "";
	текРезультат = упТарификацияВызовСервера.ВычислитьФормулу(СкомпилированнаяФормула, сткЗначенияПеременных, Отказ, Истина, ИнформацияОбОшибке);
	
	Если Отказ Тогда
		текРезультат = Нстр("ru = '<! Не рассчитан !>'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ИнформацияОбОшибке);
	Иначе	
		текРезультат = Формат(текРезультат, текФорматЧисла);
	КонецЕсли;
		
	Результат = Результат + "=" + текРезультат;
	
	текПрефиксПеременной = упТарификацияКлиентСервер.ПолучитьПрефиксПеременной();
	
	Результат = СтрЗаменить(Результат, текПрефиксПеременной, "");
	
КонецФункции

#КонецОбласти


#Область ПересчетПоказателей
&НаСервере
// Процедура - Пересчитывает значение показателя, расчет которого зависит от выбранного значения параметра.
//
// Параметры:
//  ИмяПоказателя	 - Строка	 - идентификатор показателя.
//
Процедура ПересчитатьЗначениеСсылочногоПоказателяНаСервере(ИмяПоказателя)
	// Устанавливается значение показателя.
	текИдентификаторРеквизита = "";
	Если НЕ ИдентификаторыРеквизитов.Свойство(ИмяПоказателя, текИдентификаторРеквизита) = Неопределено Тогда
		
		текПоказательСсылка = Неопределено;
		Если Показатели.Свойство(текИдентификаторРеквизита, текПоказательСсылка) Тогда
			текЗначениеПоказателя = ЭтаФорма[ИмяПоказателя];
			Отказ = Ложь;
			сткДанные =Новый Структура(ОбщегоНазначения.ИмяЗначенияПеречисления(текПоказательСсылка.ПараметрРасчета), текЗначениеПоказателя);
			текРассчитанноеЗначение = упТарификацияВызовСервера.РассчитатьПоказатель(текПоказательСсылка, сткДанные,Отказ);
			текИмяРеквизита = "Значение"+текИдентификаторРеквизита;
			текИдентификаторРеквизита = "";
			Если НЕ ИдентификаторыРеквизитов.Свойство(текИмяРеквизита, текИдентификаторРеквизита) = Неопределено Тогда
				ЗначенияПоказателей.Вставить(текИдентификаторРеквизита, текРассчитанноеЗначение);	
				ЭтаФорма[текИмяРеквизита] = текРассчитанноеЗначение;
			КонецЕсли;	
			РассчитатьФормулуНаСервере();	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура - Пересчитывает значения фиксированных показателей присутствующих в формуле.
//
// Параметры:
//  Нет.
//
Процедура ПересчитатьФиксированныеПоказателиНаСервере()
	// Поменялась организация, пересчитать все фиксированные показатели.
	текЗначение	= ЭтаФорма["ПараметрОрганизация"];
	Данные.Вставить("Организация", текЗначение);
	сткДанные 	= Новый Структура("Организация", текЗначение);
	
	Для каждого текПоказатель Из Показатели Цикл
		Если текПоказатель.Значение.ТипПоказателя = ПредопределенноеЗначение("Перечисление.упТипыПоказателейРасчета.Фиксированный") Тогда
			Отказ = Ложь;
			текРассчитанноеЗначение = упТарификацияВызовСервера.РассчитатьПоказатель(текПоказатель.Значение, сткДанные,Отказ);	
			текИмяРеквизита = текПоказатель.Ключ;
			ЗначенияПоказателей.Вставить(текПоказатель.Ключ, текРассчитанноеЗначение);	
			ЭтаФорма["Значение" + текПоказатель.Ключ] = текРассчитанноеЗначение;
		КонецЕсли;
	КонецЦикла;
	РассчитатьФормулуНаСервере();		
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
